Examples/RegionSolvers/cavityAndPlate/constant/plateHole/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

C
{
    type        uniform;
    value       434;
}

k
{
    type        uniform;
    value       60.5;
}

alpha
{
    type        uniform;
    value       1.1e-05;
}

thermalStress   yes;


// ************************************************************************* //
